# Задание-2:
#
# Написать класс, который будет удобно использовать для работы с (на выбор что-нибудь одно):
# комплексными числами \ матрицами \ светофор \ микроволновка


class Microwave:

    def __init__(self):
        self.power = power
        self.length = a
        self.width = b
        self.height = c

    def volume(self, a, b, c):
        V = a * b * c / 1000
        print(f'Объем печи: {V} литров')

    def diameter_pan(self, b):
        D = b - 10
        print(f'Диаметр поддона: {D} см.')

